backend/performance/load-test.yaml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load phase"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check"
    flow:
      - get:
          url: "/api/health"